load-testing/favorites.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 100
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 100
      name: "Sustained light load"
    - duration: 30
      arrivalRate: 100
      rampTo: 500
      name: "Warm up to max load"
    - duration: 60
      arrivalRate: 500
      name: "Sustained max load"
  payload:
    path: "./csv/favorites.csv"
    fields:
      - "tweet_id"
      - "favoriter_id"
      - "author_id"
      - "destroy"
scenarios:
  - name: "Favorite a tweet"
    flow:
      - post:
          url: "/favorite"
          json:
            tweet_id: '{{ tweet_id }}'
            favoriter_id: '{{ favoriter_id }}'
            author_id: '{{ author_id }}'
            destroy: '{{ destroy }}'